system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#inputSyntax slash;

scale 1;

sidemax  0.5;
sidemin -0.5;
ncells 35;  

backgroundMesh
{
    xMin    $sidemin;
    xMax    $sidemax;
    yMin    $sidemin;
    yMax    $sidemax;
    zMin    $sidemin;
    zMax    $sidemax;
    xCells  $ncells;
    yCells  $ncells;
    zCells  $ncells;
}

vertices
(
    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMin)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMin)

    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMax)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $!backgroundMesh/xCells
        $!backgroundMesh/yCells
        $!backgroundMesh/zCells
    )
    simpleGrading (1 1 1)
);

boundary
(

    front
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    back
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }
    right
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }

);

// ************************************************************************* //
