0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 8.0;
    format ascii;
    class volVectorField;
    object U;
}

//#include "/opt/OpenFOAM/OpenFOAM-8/etc/caseDicts/setConstraintTypes"

dimensions [0 1 -1 0 0 0 0];

internalField uniform (0.0 0.0 -0.5);

boundaryField
{
    quad
    {
        type noSlip;
    }

    "(front|back|left|right)" 
    {
        type slip;
    }


    top
    {
        type freestream;
        freestreamValue $internalField;
    }

    bottom
    {
        type freestream;
        freestreamValue $internalField;
    }

    "proc.*"{
        type processor;
    }
}


