0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

//#include "/opt/OpenFOAM/OpenFOAM-8/etc/caseDicts/setConstraintTypes"

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.00015;

boundaryField
{
    quad
    {
        type epsilonWallFunction;
        value $internalField;
    }

    "(front|back|left|right)" 
    {
        type slip;
    }
    top
    {
        type fixedValue;
        value $internalField;
    }
    bottom
    {
        type zeroGradient;
    }

    "proc.*"{
        type processor;
    }

}
