0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

//#include "/opt/OpenFOAM/OpenFOAM-8/etc/caseDicts/setConstraintTypes"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0015;

boundaryField
{
    quad
    {
        type kqRWallFunction;
        value 0.000015;
    }

    "(front|back|left|right)"
    {
        type slip;
    }
    top
    {
        type fixedValue;
        value $internalField;
    }
    bottom
    {
        type inletOutlet;
        inletValue $internalField;
        value $internalField;
    }

    "proc.*"{
        type processor;
    }
}


