0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

//#include "/opt/OpenFOAM/OpenFOAM-8/etc/caseDicts/setConstraintTypes"

dimensions      [0 2 -1 0 0 0 0];

internalField  uniform 0.000001;

boundaryField
{
    quad
    {
        type fixedValue;
        value uniform 0;
    }
    "(front|back|left|right)"
    {
        type zeroGradient;
    }

    top
    {
        type fixedValue;
        value $internalField;
    }
    bottom
    {
        type zeroGradient;
    }

    "proc.*"{
        type processor;
    }
}

