0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField  uniform 0.000001;

boundaryField
{
    quad
    {
        type nutUSpaldingWallFunction;
        value $internalField;
    }

    "(front|back|left|right)"
    {
        type calculated;
        value $internalField;
    }


    top
    {
        type calculated;
        value $internalField;
    }
    bottom
    {
        type calculated;
        value $internalField;
    }

    "proc.*"{
        type processor;
    }
}


