system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    turbulence      bounded Gauss limitedLinear 1;
    default         none;

    div(phi,epsilon) bounded Gauss limitedLinear 1;
    //div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,U)      Gauss QUICK;
    div(phi,nuTilda) bounded Gauss linearUpwind grad(nuTilda);
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;
    div(phi,T)      $turbulence;


    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
