system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pTolerance 1e-6;
uTolerance 1e-6;
solvers
{
    "(p|pFinal)"
    {
        solver          PCG;
        preconditioner  FDIC;

        //solver          GAMG;
        //smoother        GaussSeidel;

        tolerance       $pTolerance;
        relTol          0.01;
    }

    "(U|UFinal|k|kFinal|omega|omegaFinal|epsilon|epsilonFinal|nuTilda|nuTildaFinal)"//epsilon|R
    {
       //solver           smoothSolver;
       //smoother	        symGaussSeidel;

	   solver		    PBiCGStab;
       preconditioner DILU;

       tolerance        $uTolerance;
	   relTol 0.01;
    }
}


SIMPLE
{
    defaultResidual 1e-4;
    consistent yes;
    residualControl
    {
        p               $defaultResidual;
        U               $defaultResidual;
        nuTilda         $defaultResidual;
        omega           $defaultResidual;
        k               $defaultResidual;
        epsilon         $defaultResidual;
    }
    nNonOrthogonalCorrectors 2;
    convergenceCriterion 1.0e-4;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
}


PIMPLE
{
    correctPhi          no;
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 2;
    pRefCell            0;
    pRefValue           0;
    convergenceCriterion 1.0e-4;
}



potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.5;
        ".*"            0.5;
    }
}


